user_sample/app/controllers/restores_controller.rb

    def set_user
      @duser = User.with_deleted.find(params[:id])
---
SELECT `users`.* FROM `users` WHERE (`users`.`deleted_at` IS NOT NULL)