user_sample/app/controllers/users_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`deleted_at` IS NULL
---
  def index
    @users = User.all

INSERT INTO `users` (`user_id`, `password`, `name`, `grade`, `registered_at`, `updated_at`, `created_at`) VALUES ('2', 'pass', 'YuumaSawada', 'B3', '2018-01-26 06:02:00', '2018-01-26 06:03:10', '2018-01-26 06:03:10')
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save

UPDATE `users` SET `user_id` = 'qqあq', `password` = 'ああ', `name` = 'あああ', `updated_at` = '2018-01-27 04:52:19' WHERE `users`.`id` = 13
---
  def update
    respond_to do |format|
      if @user.update(user_params)

DELETE FROM `users` WHERE `users`.`id` = 2
UPDATE `users` SET `users`.`deleted_at` = '2018-01-26 07:27:14', `users`.`updated_at` = '2018-01-26 07:27:14' WHERE `users`.`id` = 8
---
  def destroy
    if @flag == true then
      @user.destroy
      respond_to do |format|
      format.html { redirect_to users_url, notice: @user.name+'を消去しました' }
      format.json { head :no_content }
      end
    else
      @user.restore

SELECT  `users`.* FROM `users` WHERE `users`.`deleted_at` IS NULL AND `users`.`id` = 12 LIMIT 1
---
    def set_user
      @user = User.with_deleted.find(params[:id])