userd_sample/app/controllers/userds_controller.rb

  def index
    @userds = Userd.all.without_deleted
---
SELECT `userds`.* FROM `userds` WHERE `userds`.`deleted_at` IS NULL

  def create
    @userd = Userd.new(userd_params)

    respond_to do |format|
      if @userd.save
---
INSERT INTO `userds` (`name`, `grade`, `password`, `registered_at`, `updated_at`, `deleted_at`, `created_at`) VALUES ('優真', 'B3', 'sawada1002', '2018-01-23 04:58:00', '2018-01-23 04:58:00', '2018-01-23 04:58:00', '2018-01-23 04:59:06')

  def destroy
    # @userd.destroy
    # respond_to do |format|
      # format.html { redirect_to userds_url, notice: 'Userd was successfully destroyed.' }
      # format.json { head :no_content }
    # end
    Userd.destroy(@userd.id)
---
DELETE FROM `userds` WHERE `userds`.`id` = 1

    def set_userd
      @userd = Userd.find(params[:id])
---
SELECT  `userds`.* FROM `userds` WHERE `userds`.`deleted_at` IS NULL AND `userds`.`id` = 7 LIMIT 1